---
kind: method
id: M:Autodesk.Revit.DB.Structure.FabricSheetType.GetReinforcementRoundingManager
source: html/bcb66de9-4e74-6ddf-5a01-d2a009d25224.htm
---
# Autodesk.Revit.DB.Structure.FabricSheetType.GetReinforcementRoundingManager Method

Returns an object for managing reinforcement rounding override settings.

## Syntax (C#)
```csharp
public FabricRoundingManager GetReinforcementRoundingManager()
```

## Returns
The rounding manager.